
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.et_cos_postgres_host_v15
* Replace
  * module.postgres.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgres.azurerm_postgresql_flexible_server_database.pg_databases[&#34;et_cos&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et_cos_postgres_host_v15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "et_cos_postgres_host_v15" {
        id                      = "https://et-cos-prod.vault.azure.net/secrets/et-cos-postgres-host-v15/f8aa07a1e3674dd4bf11d5c409fc5b8f"
        name                    = "et-cos-postgres-host-v15"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "et-cos-postgres-v15-prod.postgres.database.azure.com" -> (known after apply)
      ~ geo_redundant_backup_enabled  = false -> true # forces replacement
      ~ id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-cos-postgres-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/et-cos-postgres-v15-prod" -> (known after apply)
        name                          = "et-cos-postgres-v15-prod"
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "Team Contact"        = "#et-tech"
            "application"         = "employment-tribunals"
            "builtFrom"           = "et-ccd-callbacks"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-developers"
            "environment"         = "prod"
            "managedBy"           = "Employment Tribunals"
        }
      - zone                          = "1" -> null
        # (14 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-cos-postgres-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/et-cos-postgres-v15-prod/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-cos-postgres-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/et-cos-postgres-v15-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgres.azurerm_postgresql_flexible_server_database.pg_databases["et_cos"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-cos-postgres-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/et-cos-postgres-v15-prod/databases/et_cos" -> (known after apply)
        name      = "et_cos"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-cos-postgres-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/et-cos-postgres-v15-prod" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2153,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->